import doctorImage from "@/shared/assets/img/Doc/docer.png";
import type { DoctorDetailsType } from "./types";

export const doctorDetailsData: DoctorDetailsType[] = [
  {
    id: 1,
    name: "Жаныбек Асанкулов",
    specialization: "Кардиология",
    experience: "14 лет",
    rating: 4.9,
    reviews: 18,
    image: doctorImage,

    education:
      "Кыргызская Государственная Медицинская Академия, факультет лечебного дела (окончил с отличием).",

    about:
      "Опытный кардиолог с более чем 14-летней практикой. Специализируется на диагностике и лечении сердечно-сосудистых заболеваний, применяет современные методы обследования и индивидуальные программы терапии. Известен внимательным отношением к каждому пациенту, умением объяснять сложные вещи простым языком и всегда ставит на первое место безопасность и комфорт человека. Регулярно повышает квалификацию, участвует в международных конференциях и ведёт просветительскую работу по профилактике сердечных заболеваний.",

    workplaces: [
      "Национальный центр кардиологии — кардиолог (8 лет)",
      "Частная клиника «Медлайн» — ведущий специалист (6 лет)",
    ],

    skills: [
      "Диагностика и лечение заболеваний сердечно-сосудистой системы",
      "ЭКГ, ЭХО-КГ и нагрузочные тесты",
      "Составление индивидуальных программ реабилитации после операций на сердце",
      "Лечение артериальной гипертонии, аритмий и ишемической болезни сердца",
    ],
  },

  {
    id: 2,
    name: "Кадыржакунов Нурлан",
    specialization: "Хирургия",
    experience: "14 лет",
    rating: 4.9,
    reviews: 18,
    image: doctorImage,

    education:
      "Кыргызская Государственная Медицинская Академия, факультет лечебного дела.",

    about:
      "Опытный хирург с многолетней практикой. Специализируется на диагностике, лечении и наблюдении пациентов. Использует современные методы лечения и индивидуальный подход к каждому пациенту.",

    workplaces: [
      "Национальный хирургический центр — хирург (8 лет)",
      "Частная клиника «Медлайн» — ведущий специалист (6 лет)",
    ],

    skills: [
      "Диагностика хирургических заболеваний",
      "Современные методы хирургического лечения",
      "Послеоперационное наблюдение",
      "Индивидуальное ведение пациентов",
    ],
  },

  {
    id: 3,
    name: "Кадыржакунов Нурлан",
    specialization: "Хирургия",
    experience: "12 лет",
    rating: 4.8,
    reviews: 15,
    image: doctorImage,

    education:
      "Кыргызская Государственная Медицинская Академия, факультет лечебного дела.",

    about:
      "Врач-хирург с большим опытом практической работы. Занимается диагностикой и лечением хирургических заболеваний.",

    workplaces: [
      "Городская клиническая больница — хирург (7 лет)",
      "Частная клиника — хирург (5 лет)",
    ],

    skills: [
      "Диагностика заболеваний",
      "Хирургическое лечение",
      "Послеоперационная реабилитация",
      "Консультация пациентов",
    ],
  }, 
  {
    id: 4,
    name: "Кадыржакунов Нурлан",
    specialization: "Хирургия",
    experience: "12 лет",
    rating: 4.8,
    reviews: 15,
    image: doctorImage,

    education:
      "Кыргызская Государственная Медицинская Академия, факультет лечебного дела.",

    about:
      "Врач-хирург с большим опытом практической работы. Занимается диагностикой и лечением хирургических заболеваний.",

    workplaces: [
      "Городская клиническая больница — хирург (7 лет)",
      "Частная клиника — хирург (5 лет)",
    ],

    skills: [
      "Диагностика заболеваний",
      "Хирургическое лечение",
      "Послеоперационная реабилитация",
      "Консультация пациентов",
    ],
  }, 
   {
    id: 5,
    name: "Кадыржакунов Нурлан",
    specialization: "Хирургия",
    experience: "12 лет",
    rating: 4.8,
    reviews: 15,
    image: doctorImage,

    education:
      "Кыргызская Государственная Медицинская Академия, факультет лечебного дела.",

    about:
      "Врач-хирург с большим опытом практической работы. Занимается диагностикой и лечением хирургических заболеваний.",

    workplaces: [
      "Городская клиническая больница — хирург (7 лет)",
      "Частная клиника — хирург (5 лет)",
    ],

    skills: [
      "Диагностика заболеваний",
      "Хирургическое лечение",
      "Послеоперационная реабилитация",
      "Консультация пациентов",
    ],
  }, 
   {
    id: 6,
    name: "Кадыржакунов Нурлан",
    specialization: "Хирургия",
    experience: "12 лет",
    rating: 4.8,
    reviews: 15,
    image: doctorImage,

    education:
      "Кыргызская Государственная Медицинская Академия, факультет лечебного дела.",

    about:
      "Врач-хирург с большим опытом практической работы. Занимается диагностикой и лечением хирургических заболеваний.",

    workplaces: [
      "Городская клиническая больница — хирург (7 лет)",
      "Частная клиника — хирург (5 лет)",
    ],

    skills: [
      "Диагностика заболеваний",
      "Хирургическое лечение",
      "Послеоперационная реабилитация",
      "Консультация пациентов",
    ],
  }, 
   {
    id: 7,
    name: "Кадыржакунов Нурлан",
    specialization: "Хирургия",
    experience: "12 лет",
    rating: 4.8,
    reviews: 15,
    image: doctorImage,

    education:
      "Кыргызская Государственная Медицинская Академия, факультет лечебного дела.",

    about:
      "Врач-хирург с большим опытом практической работы. Занимается диагностикой и лечением хирургических заболеваний.",

    workplaces: [
      "Городская клиническая больница — хирург (7 лет)",
      "Частная клиника — хирург (5 лет)",
    ],

    skills: [
      "Диагностика заболеваний",
      "Хирургическое лечение",
      "Послеоперационная реабилитация",
      "Консультация пациентов",
    ],
  }, 
   {
    id: 8,
    name: "Кадыржакунов Нурлан",
    specialization: "Хирургия",
    experience: "12 лет",
    rating: 4.8,
    reviews: 15,
    image: doctorImage,

    education:
      "Кыргызская Государственная Медицинская Академия, факультет лечебного дела.",

    about:
      "Врач-хирург с большим опытом практической работы. Занимается диагностикой и лечением хирургических заболеваний.",

    workplaces: [
      "Городская клиническая больница — хирург (7 лет)",
      "Частная клиника — хирург (5 лет)",
    ],

    skills: [
      "Диагностика заболеваний",
      "Хирургическое лечение",
      "Послеоперационная реабилитация",
      "Консультация пациентов",
    ],
  }, 
   {
    id: 9,
    name: "Кадыржакунов Нурлан",
    specialization: "Хирургия",
    experience: "12 лет",
    rating: 4.8,
    reviews: 15,
    image: doctorImage,

    education:
      "Кыргызская Государственная Медицинская Академия, факультет лечебного дела.",

    about:
      "Врач-хирург с большим опытом практической работы. Занимается диагностикой и лечением хирургических заболеваний.",

    workplaces: [
      "Городская клиническая больница — хирург (7 лет)",
      "Частная клиника — хирург (5 лет)",
    ],

    skills: [
      "Диагностика заболеваний",
      "Хирургическое лечение",
      "Послеоперационная реабилитация",
      "Консультация пациентов",
    ],
  }, 
   {
    id: 10,
    name: "Кадыржакунов Нурлан",
    specialization: "Хирургия",
    experience: "12 лет",
    rating: 4.8,
    reviews: 15,
    image: doctorImage,

    education:
      "Кыргызская Государственная Медицинская Академия, факультет лечебного дела.",

    about:
      "Врач-хирург с большим опытом практической работы. Занимается диагностикой и лечением хирургических заболеваний.",

    workplaces: [
      "Городская клиническая больница — хирург (7 лет)",
      "Частная клиника — хирург (5 лет)",
    ],

    skills: [
      "Диагностика заболеваний",
      "Хирургическое лечение",
      "Послеоперационная реабилитация",
      "Консультация пациентов",
    ],
  },  
];